# Third-Party Repositories
tap "homebrew/core"
tap "homebrew/cask"
# tap "homebrew/bundle"

# packages
brew "git"
brew "vim"
brew "tmux"
brew "bash"
brew "curl"
brew "python"
brew "python3"
brew "node"
brew "gh"

# macOS applications 
cask "firefox"
cask "macs-fan-control"
cask "github"

# Mac App Store
mas "Microsoft Remote Desktop", id: 1295203466
mas "Keynote", id: 409183694
mas "Namecheap VPN", id: 1419729466
mas "OneDrive", id: 823766827
