# Third-Party Repositories
tap "homebrew/core"
tap "homebrew/cask"

# packages
brew "bash"
brew "cloudflared"
brew "curl"
brew "flyctl"
brew "gh"
brew "git"
brew "mas"
brew "nodenv"
brew "ocrmypdf"
brew "pyenv"
brew "rbenv"
brew "rclone"
brew "sqlite"
brew "tmux"
brew "vim"

# macOS applications
cask "alacritty"
cask "firefox"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "macs-fan-control"
cask "visual-studio-code"
cask "warp"

# Mac App Store
mas "Keynote", id: 409183694
mas "The Unarchiver", id: 425424353
mas "OneDrive", id: 823766827
mas "FastVPN", id: 1419729466
